function select(){
    let regions = {
        cnt: ["Белгородская область", "Брянская область","Владимирская область", "Воронежская область", "Ивановская область","Калужская область" ,"Костромская область", "Курская область", "Липецкая область", "Московская область", "Орловская область","Рязанская область","Смоленская область","Тамбовская область", "Тверская область", "Тульская область", "Ярославская область", "Москва"],
        svz: ["Республика Карелия", "Республика Коми", "Архангельская область", "Вологодская область","Калининградская область", "Ленинградская область", "Мурманская область", "Новгородская область", "Псковская область", "Санкт-Петербург", "Ненецкий автономный округ"],
        sou: ["Республика Адыгея", "Республика Калмыкия", "Республика Крым", "Краснодарский край", "Астраханская область", "Волгоградская область", "Ростовская область", "Севастополь"],
        svk: ["Республика Дагестан", "Республика Ингушетия", "Кабардино-Балкарская Республика", "Карачаево-Черкесская Республика", "Республика Северная Осетия", "Чеченская республика", "Ставропольский край"],
        prv: ["Республика Башкортостан", "Республика Марий Эл","Республика Мордовия","Республика Татарстан","Удмуртская Республика","Чувашская республика", "Пермский край", "Кировская область", "Нижегородская область", "Оренбургская область", "Пензенская область", "Самарская область", "Саратовская область", "Ульяновская область"],
        url: ["Курганская область", "Свердловская область", "Тюменская область", "Челябинская область","Ханты-Мансийский автономный округ — Югра","Ямало-Ненецкий автономный округ"],
        sbr: ["Республика Алтай", "Республика Тыва", "Республика Хакасия", "Алтайский край", "Красноярский край", "Иркутская область", "Кемеровская область", "Новосибирская область", "Омская область", "Томская область"],
        dvs: ["Республика Бурятия", "Республика Якутия", "Забайкальский край", "Камчатский край", "Приморский край", "Хабаровский край", "Амурская область", "Магаданская область", "Сахалинская область", "Еврейская автономная область", "Чукотский автономный округ"]
    };
    let district = document.getElementById("district");
    let region = document.querySelector("#region");
    window.onload = selectRegion;
    if(document.getElementById("large_search").style.display!="none"){
        district.onchange = selectRegion;
    }

    function selectRegion(ev){
        region.innerHTML = "";
        let c = this.value || "ctr", o;
        for(let i = 0; i < regions[c].length; i++){
            o = new Option(regions[c][i],i,false,false);
            region.add(o);
        };
    }
}
function showOrHideSearch(element1) {
    let search = document.getElementById(element1);
    let region = document.querySelector('#region');
    if (search.style.display !== 'block') {
        search.style.display = 'block';
    } else {
        search.style.display = 'none';
    }
    if(search.style.display = 'none'){
        region.value="chn";
    }
}